---
kind: type
id: T:Autodesk.Revit.DB.CategoryNameMap
source: html/d452bf69-eef2-2d6c-1e8d-cc059c0fe513.htm
---
# Autodesk.Revit.DB.CategoryNameMap

A map that contains a mapping of category name to its category object.

## Syntax (C#)
```csharp
public class CategoryNameMap : APIObject,
	IEnumerable
```